nkswalih/feat/KRV-045-agentic-AI-and-frontend-integration
Ref/KRV 04 Agentic AI & Frontend Integration 

- CI Failed Becuase of the CodeQL
- Readme Updated
- logo changed
